letulet-app/wsdl/EVRNService.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="EVRNService" targetNamespace="http://www.escapia.com/EVRN/2007/02" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.escapia.com/EVRN/2007/02" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="BasicHttpBinding_IEVRNService_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xsd:schema targetNamespace="http://www.escapia.com/EVRN/2007/02/Imports"><xsd:import schemaLocation="https://api.escapia.com/EVRNService.svc?xsd=xsd0" namespace="http://www.escapia.com/EVRN/2007/02"/></xsd:schema></wsdl:types><wsdl:message name="UnitDescriptiveInfoRequest"><wsdl:part name="EVRN_UnitDescriptiveInfoRQ" element="tns:EVRN_UnitDescriptiveInfoRQ"/></wsdl:message><wsdl:message name="UnitDescriptiveInfoResponse"><wsdl:part name="EVRN_UnitDescriptiveInfoRS" element="tns:EVRN_UnitDescriptiveInfoRS"/></wsdl:message><wsdl:message name="UnitSearchRequest"><wsdl:part name="EVRN_UnitSearchRQ" element="tns:EVRN_UnitSearchRQ"/></wsdl:message><wsdl:message name="UnitSearchResponse"><wsdl:part name="EVRN_UnitSearchRS" element="tns:EVRN_UnitSearchRS"/></wsdl:message><wsdl:message name="UnitCalendarAvailRequest"><wsdl:part name="EVRN_UnitCalendarAvailRQ" element="tns:EVRN_UnitCalendarAvailRQ"/></wsdl:message><wsdl:message name="UnitCalendarAvailResponse"><wsdl:part name="EVRN_UnitCalendarAvailRS" element="tns:EVRN_UnitCalendarAvailRS"/></wsdl:message><wsdl:message name="UnitStayRequest"><wsdl:part name="EVRN_UnitStayRQ" element="tns:EVRN_UnitStayRQ"/></wsdl:message><wsdl:message name="UnitStayResponse"><wsdl:part name="EVRN_UnitStayRS" element="tns:EVRN_UnitStayRS"/></wsdl:message><wsdl:message name="UnitResRequest"><wsdl:part name="EVRN_UnitResRQ" element="tns:EVRN_UnitResRQ"/></wsdl:message><wsdl:message name="UnitResResponse"><wsdl:part name="EVRN_UnitResRS" element="tns:EVRN_UnitResRS"/></wsdl:message><wsdl:message name="UnitReadRequest"><wsdl:part name="EVRN_UnitReadRQ" element="tns:EVRN_UnitReadRQ"/></wsdl:message><wsdl:message name="UnitInquiryRequest"><wsdl:part name="EVRN_UnitInquiryRQ" element="tns:EVRN_UnitInquiryRQ"/></wsdl:message><wsdl:message name="UnitInquiryResponse"><wsdl:part name="EVRN_UnitInquiryRS" element="tns:EVRN_UnitInquiryRS"/></wsdl:message><wsdl:message name="UnitCalendarAvailBatchRequest"><wsdl:part name="EVRN_UnitCalendarAvailBatchRQ" element="tns:EVRN_UnitCalendarAvailBatchRQ"/></wsdl:message><wsdl:message name="UnitCalendarAvailBatchResponse"><wsdl:part name="EVRN_UnitCalendarAvailBatchRS" element="tns:EVRN_UnitCalendarAvailBatchRS"/></wsdl:message><wsdl:message name="CampaignRequest"><wsdl:part name="EVRN_CampaignRQ" element="tns:EVRN_CampaignRQ"/></wsdl:message><wsdl:message name="CampaignResponse"><wsdl:part name="EVRN_CampaignRS" element="tns:EVRN_CampaignRS"/></wsdl:message><wsdl:message name="PropertyManagerRequest"><wsdl:part name="EVRN_PropertyManagerRQ" element="tns:EVRN_PropertyManagerRQ"/></wsdl:message><wsdl:message name="PropertyManagerResponse"><wsdl:part name="EVRN_PropertyManagerRS" element="tns:EVRN_PropertyManagerRS"/></wsdl:message><wsdl:message name="UnitHoldRequest"><wsdl:part name="EVRN_UnitHoldRQ" element="tns:EVRN_UnitHoldRQ"/></wsdl:message><wsdl:message name="UnitHoldResponse"><wsdl:part name="EVRN_UnitHoldRS" element="tns:EVRN_UnitHoldRS"/></wsdl:message><wsdl:message name="ReservationCancelRequest"><wsdl:part name="EVRN_ReservationCancelRQ" element="tns:EVRN_ReservationCancelRQ"/></wsdl:message><wsdl:message name="ReservationCancelResponse"><wsdl:part name="EVRN_ReservationCancelRS" element="tns:EVRN_ReservationCancelRS"/></wsdl:message><wsdl:message name="ReservationUpdateRequest"><wsdl:part name="EVRN_ReservationUpdateRQ" element="tns:EVRN_ReservationUpdateRQ"/></wsdl:message><wsdl:message name="ReservationUpdateResponse"><wsdl:part name="EVRN_ReservationUpdateRS" element="tns:EVRN_ReservationUpdateRS"/></wsdl:message><wsdl:portType name="IEVRNService"><wsdl:operation name="UnitDescriptiveInfo"><wsdl:input wsaw:Action="UnitDescriptiveInfo" name="UnitDescriptiveInfoRequest" message="tns:UnitDescriptiveInfoRequest"/><wsdl:output wsaw:Action="UnitDescriptiveInfo" name="UnitDescriptiveInfoResponse" message="tns:UnitDescriptiveInfoResponse"/></wsdl:operation><wsdl:operation name="UnitSearch"><wsdl:input wsaw:Action="UnitSearch" name="UnitSearchRequest" message="tns:UnitSearchRequest"/><wsdl:output wsaw:Action="UnitSearch" name="UnitSearchResponse" message="tns:UnitSearchResponse"/></wsdl:operation><wsdl:operation name="UnitCalendarAvail"><wsdl:input wsaw:Action="UnitCalendarAvail" name="UnitCalendarAvailRequest" message="tns:UnitCalendarAvailRequest"/><wsdl:output wsaw:Action="UnitCalendarAvail" name="UnitCalendarAvailResponse" message="tns:UnitCalendarAvailResponse"/></wsdl:operation><wsdl:operation name="UnitStay"><wsdl:input wsaw:Action="UnitStay" name="UnitStayRequest" message="tns:UnitStayRequest"/><wsdl:output wsaw:Action="UnitStay" name="UnitStayResponse" message="tns:UnitStayResponse"/></wsdl:operation><wsdl:operation name="UnitRes"><wsdl:input wsaw:Action="UnitRes" name="UnitResRequest" message="tns:UnitResRequest"/><wsdl:output wsaw:Action="UnitRes" name="UnitResResponse" message="tns:UnitResResponse"/></wsdl:operation><wsdl:operation name="UnitRead"><wsdl:input wsaw:Action="UnitRead" name="UnitReadRequest" message="tns:UnitReadRequest"/><wsdl:output wsaw:Action="UnitRead" name="UnitResResponse" message="tns:UnitResResponse"/></wsdl:operation><wsdl:operation name="UnitInquiry"><wsdl:input wsaw:Action="UnitInquiry" name="UnitInquiryRequest" message="tns:UnitInquiryRequest"/><wsdl:output wsaw:Action="UnitInquiry" name="UnitInquiryResponse" message="tns:UnitInquiryResponse"/></wsdl:operation><wsdl:operation name="UnitCalendarAvailBatch"><wsdl:input wsaw:Action="UnitCalendarAvailBatch" name="UnitCalendarAvailBatchRequest" message="tns:UnitCalendarAvailBatchRequest"/><wsdl:output wsaw:Action="UnitCalendarAvailBatch" name="UnitCalendarAvailBatchResponse" message="tns:UnitCalendarAvailBatchResponse"/></wsdl:operation><wsdl:operation name="Campaign"><wsdl:input wsaw:Action="Campaign" name="CampaignRequest" message="tns:CampaignRequest"/><wsdl:output wsaw:Action="Campaign" name="CampaignResponse" message="tns:CampaignResponse"/></wsdl:operation><wsdl:operation name="PropertyManager"><wsdl:input wsaw:Action="PropertyManager" name="PropertyManagerRequest" message="tns:PropertyManagerRequest"/><wsdl:output wsaw:Action="PropertyManager" name="PropertyManagerResponse" message="tns:PropertyManagerResponse"/></wsdl:operation><wsdl:operation name="UnitHold"><wsdl:input wsaw:Action="UnitHold" name="UnitHoldRequest" message="tns:UnitHoldRequest"/><wsdl:output wsaw:Action="UnitHold" name="UnitHoldResponse" message="tns:UnitHoldResponse"/></wsdl:operation><wsdl:operation name="ReservationCancel"><wsdl:input wsaw:Action="ReservationCancel" name="ReservationCancelRequest" message="tns:ReservationCancelRequest"/><wsdl:output wsaw:Action="ReservationCancel" name="ReservationCancelResponse" message="tns:ReservationCancelResponse"/></wsdl:operation><wsdl:operation name="UnitCalendarAvailExtended"><wsdl:input wsaw:Action="UnitCalendarAvailExtended" name="UnitCalendarAvailRequest" message="tns:UnitCalendarAvailRequest"/><wsdl:output wsaw:Action="UnitCalendarAvailExtended" name="UnitCalendarAvailResponse" message="tns:UnitCalendarAvailResponse"/></wsdl:operation><wsdl:operation name="ReservationUpdate"><wsdl:input wsaw:Action="ReservationUpdate" name="ReservationUpdateRequest" message="tns:ReservationUpdateRequest"/><wsdl:output wsaw:Action="ReservationUpdate" name="ReservationUpdateResponse" message="tns:ReservationUpdateResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IEVRNService" type="tns:IEVRNService"><wsp:PolicyReference URI="#BasicHttpBinding_IEVRNService_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="UnitDescriptiveInfo"><soap:operation soapAction="UnitDescriptiveInfo" style="document"/><wsdl:input name="UnitDescriptiveInfoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitDescriptiveInfoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitSearch"><soap:operation soapAction="UnitSearch" style="document"/><wsdl:input name="UnitSearchRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitSearchResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitCalendarAvail"><soap:operation soapAction="UnitCalendarAvail" style="document"/><wsdl:input name="UnitCalendarAvailRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitCalendarAvailResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitStay"><soap:operation soapAction="UnitStay" style="document"/><wsdl:input name="UnitStayRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitStayResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitRes"><soap:operation soapAction="UnitRes" style="document"/><wsdl:input name="UnitResRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitResResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitRead"><soap:operation soapAction="UnitRead" style="document"/><wsdl:input name="UnitReadRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitResResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitInquiry"><soap:operation soapAction="UnitInquiry" style="document"/><wsdl:input name="UnitInquiryRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitInquiryResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitCalendarAvailBatch"><soap:operation soapAction="UnitCalendarAvailBatch" style="document"/><wsdl:input name="UnitCalendarAvailBatchRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitCalendarAvailBatchResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Campaign"><soap:operation soapAction="Campaign" style="document"/><wsdl:input name="CampaignRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="CampaignResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="PropertyManager"><soap:operation soapAction="PropertyManager" style="document"/><wsdl:input name="PropertyManagerRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="PropertyManagerResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitHold"><soap:operation soapAction="UnitHold" style="document"/><wsdl:input name="UnitHoldRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitHoldResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ReservationCancel"><soap:operation soapAction="ReservationCancel" style="document"/><wsdl:input name="ReservationCancelRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ReservationCancelResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UnitCalendarAvailExtended"><soap:operation soapAction="UnitCalendarAvailExtended" style="document"/><wsdl:input name="UnitCalendarAvailRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="UnitCalendarAvailResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ReservationUpdate"><soap:operation soapAction="ReservationUpdate" style="document"/><wsdl:input name="ReservationUpdateRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="ReservationUpdateResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="EVRNService"><wsdl:port name="BasicHttpBinding_IEVRNService" binding="tns:BasicHttpBinding_IEVRNService"><soap:address location="https://api.escapia.com/EVRNService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>